In [2]:
import pandas as pd
df = pd.read_excel('05.xlsx',sheet_name=0)
df

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
1  ID2  徐二  女  82  88  87
2  ID3  张三  男  83  99  99
3  ID4  李四  女  84  67  77
4  ID5  王五  男  85  88  79
5  ID6  罗六  女  86  69  96
6  ID7  安七  男  87  77  84

In [3]:
# eq()函数
df[df['性别'] == '男']

   ID号  姓名 性别  语文  数学  英语
0  ID1  陈一  男  81  94  61
2  ID3  张三  男  83  99  99
4  ID5  王五  男  85  88  79
6  ID7  安七  男  87  77  84

In [5]:
df[df['性别'].eq('女')]

   ID号  姓名 性别  语文  数学  英语
1  ID2  徐二  女  82  88  87
3  ID4  李四  女  84  67  77
5  ID6  罗六  女  86  69  96

In [7]:
df = pd.read_excel('06.xlsx',sheet_name=0)
df

     名称     开盘     最高     最低     收盘  行业
0  中国石油   8.03   8.10   7.98   8.03  石化
1  工商银行   6.06   6.11   6.03   6.05  银行
2  上海石化   3.00   3.03   2.98   2.98  石化
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [9]:
# ne()函数
df[df['行业'] != '石化']

     名称     开盘     最高     最低     收盘  行业
1  工商银行   6.06   6.11   6.03   6.05  银行
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [11]:
df[df['行业'].ne('石化')]

     名称     开盘     最高     最低     收盘  行业
1  工商银行   6.06   6.11   6.03   6.05  银行
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [13]:
# lt()函数
df[df.最高<10]

     名称    开盘    最高    最低    收盘  行业
0  中国石油  8.03  8.10  7.98  8.03  石化
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化
3  建设银行  7.91  8.00  7.86  7.92  银行

In [15]:
df[df.最高.lt(10)]

     名称    开盘    最高    最低    收盘  行业
0  中国石油  8.03  8.10  7.98  8.03  石化
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化
3  建设银行  7.91  8.00  7.86  7.92  银行

In [18]:
# 平均值筛选
df[df.最高<df.最高.mean()]

     名称    开盘    最高    最低    收盘  行业
0  中国石油  8.03  8.10  7.98  8.03  石化
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化
3  建设银行  7.91  8.00  7.86  7.92  银行

In [20]:
df[df.最高.lt(df['最高'].mean()-23)]

     名称    开盘    最高    最低    收盘  行业
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化

In [22]:
# 筛选指定行索引
df[df.index==1]

     名称    开盘    最高    最低    收盘  行业
1  工商银行  6.06  6.11  6.03  6.05  银行

In [25]:
df[df.index>2]

     名称     开盘     最高     最低     收盘  行业
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [26]:
# 筛选指定范围索引
df[0:3]

     名称    开盘    最高    最低    收盘  行业
0  中国石油  8.03  8.10  7.98  8.03  石化
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化

In [28]:
df[:4]

     名称    开盘    最高    最低    收盘  行业
0  中国石油  8.03  8.10  7.98  8.03  石化
1  工商银行  6.06  6.11  6.03  6.05  银行
2  上海石化  3.00  3.03  2.98  2.98  石化
3  建设银行  7.91  8.00  7.86  7.92  银行

In [32]:
df[-4:]

     名称     开盘     最高     最低     收盘  行业
2  上海石化   3.00   3.03   2.98   2.98  石化
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [33]:
# 切片倒序
df[::-1]

     名称     开盘     最高     最低     收盘  行业
5  中芯国际  96.87  98.70  94.90  94.91  芯片
4  中国平安  56.90  57.48  55.80  55.80  保险
3  建设银行   7.91   8.00   7.86   7.92  银行
2  上海石化   3.00   3.03   2.98   2.98  石化
1  工商银行   6.06   6.11   6.03   6.05  银行
0  中国石油   8.03   8.10   7.98   8.03  石化

In [39]:
# 切片奇偶行
df[0::2]

     名称     开盘     最高     最低     收盘  行业
0  中国石油   8.03   8.10   7.98   8.03  石化
2  上海石化   3.00   3.03   2.98   2.98  石化
4  中国平安  56.90  57.48  55.80  55.80  保险

In [38]:
df[1::2]

     名称     开盘     最高     最低     收盘  行业
1  工商银行   6.06   6.11   6.03   6.05  银行
3  建设银行   7.91   8.00   7.86   7.92  银行
5  中芯国际  96.87  98.70  94.90  94.91  芯片